import { add, mul } from "./index.js";
import { describe, it, expect } from "vitest";

describe("加算", () => {
  it("正常系", () => {
    const a = [
      [1, 2, 3],
      [4, 5, 6],
    ];
    const b = [
      [10, 20, 30],
      [40, 50, 60],
    ];
    expect(add(a, b)).toEqual([
      [11, 22, 33],
      [44, 55, 66],
    ]);
  });
  it("異常系：二次元配列として無効な引数がある", () => {
    const a = 1;
    const b = [[10, 20, 30]];
    expect(() => {
      add(a, b);
    }).toThrow("二次元配列として無効です");
  });
  it("異常系：空の二次元配列がある", () => {
    const a = [[], []];
    const b = [[10, 20, 30]];
    expect(() => {
      add(a, b);
    }).toThrow("二次元配列が空です");
  });
  it("異常系：各行の長さが異なる行列がある", () => {
    const a = [[1], [1, 2]];
    const b = [[10, 20, 30]];
    expect(() => {
      add(a, b);
    }).toThrow("全ての行の長さが同じである必要がある");
  });
  it("異常系：2つの行列のサイズが異なる", () => {
    const a = [
      [1, 2],
      [4, 5],
    ];
    const b = [
      [10, 20, 30],
      [40, 50, 60],
    ];
    expect(() => {
      add(a, b);
    }).toThrow("二つの行列はサイズが同じ必要がある");
  });
});

describe("乗算", () => {
  it("正常系", () => {
    const a = [
      [1, 2, 3],
      [4, 5, 6],
    ];
    const b = [
      [7, 8],
      [9, 10],
      [11, 12],
    ];
    expect(mul(a, b)).toEqual([
      [58, 64],
      [139, 154],
    ]);
  });
  it("異常系：二次元配列として無効な引数がある", () => {
    const a = 1;
    const b = [[10, 20, 30]];
    expect(() => {
      mul(a, b);
    }).toThrow("二次元配列として無効です");
  });
  it("異常系：空の二次元配列がある", () => {
    const a = [[], []];
    const b = [[10, 20, 30]];
    expect(() => {
      mul(a, b);
    }).toThrow("二次元配列が空です");
  });
  it("異常系：各行の長さが異なる行列がある", () => {
    const a = [[1], [1, 2]];
    const b = [[10, 20, 30]];
    expect(() => {
      mul(a, b);
    }).toThrow("全ての行の長さが同じである必要がある");
  });
  it("異常系：2つの行列において、片方の列数ともう片方の行数が異なる", () => {
    const a = [[1, 2, 3]];
    const b = [[10], [40]];
    expect(() => {
      mul(a, b);
    }).toThrow("第一引数の列数と第二引数の行数が同じ必要がある");
  });
});
